# Reading writing csv, excel files

# Topics:
* 1) Read csv
* 2) Write csv
* 3) Read excel
* 4) Write excel

In [1]:
#Read csv

import pandas as pd
df = pd.read_csv("stock_data.csv", skiprows = 1)
df

  tickets            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [2]:
# OR
# index start from 0 hence header = 1 really means row#2 in csv file

df = pd.read_csv("stock_data.csv", header = 1)
df       # it gives same output

  tickets            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [3]:
df = pd.read_csv("stock_data.csv", header = None)
df

             0              1        2      3              4
0  stocks data            NaN      NaN    NaN            NaN
1      tickets            eps  revenue  price         people
2        GOOGL          27.82       87    845     larry page
3          WMT           4.61      484     65           n.a.
4         MSFT             -1       85     64     bill gates
5          RIL  not available       50   1023  mukesh ambani
6         TATA            5.6       -1   n.a.     ratan tata

In [4]:
df = pd.read_csv("stock_data.csv", header = None, names = ['tickets','eps','revenue','price','people'])
df

       tickets            eps  revenue  price         people
0  stocks data            NaN      NaN    NaN            NaN
1      tickets            eps  revenue  price         people
2        GOOGL          27.82       87    845     larry page
3          WMT           4.61      484     65           n.a.
4         MSFT             -1       85     64     bill gates
5          RIL  not available       50   1023  mukesh ambani
6         TATA            5.6       -1   n.a.     ratan tata

In [5]:

df = pd.read_csv("stock_data.csv", header = 1)
df

  tickets            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [6]:
# if we want to execute only few rows 


df = pd.read_csv("stock_data.csv", header=1, nrows = 3)
df

  tickets    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [7]:
df = pd.read_csv("stock_data.csv")
df

  stocks data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     tickets            eps    revenue      price         people
1       GOOGL          27.82         87        845     larry page
2         WMT           4.61        484         65           n.a.
3        MSFT             -1         85         64     bill gates
4         RIL  not available         50       1023  mukesh ambani
5        TATA            5.6         -1       n.a.     ratan tata

In [10]:
df = pd.read_csv("stock_data.csv", na_values = ['not available','n.a.'])
df

  stocks data Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     tickets        eps    revenue      price         people
1       GOOGL      27.82         87        845     larry page
2         WMT       4.61        484         65            NaN
3        MSFT         -1         85         64     bill gates
4         RIL        NaN         50       1023  mukesh ambani
5        TATA        5.6         -1        NaN     ratan tata

In [ ]:
# Any company's revenue is not in zero but eps can be zero
df = pd.read_csv("stock_data.csv", na_values = {
    'eps' = ['not available','n.a.'],    
})
df